# split разбивает строку на несколько частей
# date = '14-09-2011'.split('-')
# print(date)
# # split - разбить (с англ.)
# print(2025 - int(date[2]))
#
#
# words = input().split()

# Пользователь вводит время в формате hh:mm:ss
# Отдельно вывести часы, минуты, секунды(на отдельных строках)
# t = input().split(":") # ['16', '49', '00']
# print(t[0])
# print(t[1])
# print(t[2])


lst = [100, 200, 300, 400]
print(lst[0])
print(lst[1])
print(lst[2])
print(lst[3])


for i in range(4):
    print(lst[i])


