# lst = [1, 2, 3, 4, 5]
# print(lst[0])
# print(lst[1])
# print(lst[2])
# print(lst[3])
# print(len(lst))
# for i in range(len(lst)):
#     print(lst[i])


# Дан список. Вывести все элементы этого списка,
# которые стоят на четных позициях
# lst = [11, 24, 32, 41, 114]
#
# for i in range(4, -1, -1):
#     print(lst[i])