# 1 способ
lst = []
# lst = list()
size = int(input()) #4

for _ in range(size):
    lst.append(int(input()))
# print(lst)
# 2 способ
# lst = input().split()
# print(lst)

# t = []
# t.append(78)
# print(t)
# t.append(45)
# print(t)
# t.append(100)
# print(t)
# t.append(123)
# print(t)

# Пользователь вводит число n - кол-во элементов в списке
# А далее на следующих n строках вводит слова. Необходимо
# добавить все введенные слова в списк
# и распечатать его
# l = []
# r = int(input()) # 5
# for _ in range(r):
#     l.append(input())

# l = [1, 2, 3, 4, 5]
# for i in range(len(l)):
#     l.append(l[i])
# print(l)

# l.append(l[0])
# l.append(l[1])
# l.append(l[2])

# 1 2 3 4 5
# 1 2 3 4 5 1 2 3 4 5