# n = 12345
# while n > 0:
#     last = n % 10
#     print(last) # какая-то обработка
#     n //= 10

# while True:
#     n = int(input())
#     if n == 10:
#         break

# Пользователь вводит числа, пока не введет 10
# n = int(input())
# while n != 10:
#     n = int(input())


# Пользователь вводит числа, пока не введет 0.
# Каждое из чисел неободимо распечатать

# while True:
#     a = int(input())
#     if a == 0:
#         break
#     print(a)


# Списки
# 4 5 5 5
# m1 = 4
# m2 = 5
# m3 = 5
# m4 = 5
# print((m1 + m2 + m3 + m4))
# Список - упорядоченная мультитипная изменяемая коллекция
# marks = [4, 5, 5, 5] # Создание списка
# fruits = ['Малина', 'Арбуз', 'Банан', 'Яблоко'] # Создание списка
# amelia = ['14.09.2011', 'Азимова Амелия Андреевна', 'amelikws', 'амелькинкс', True, 13]
# marks2 = []
# lst = list() # пустой список
letters = list('amelia')
numbers = list(range(1, 10))
# print(*numbers)
# print(*letters)
#
# print(lst)
# print(marks)
# print(*marks)
# print(amelia[0])
# print(amelia[3])
# print(amelia[-1])
# print(amelia[3])
#


# n = [1, 2, 3]
# a = []
# s = list()
# f = list('amelikws')
# print(*f)

# line = "Hello"
# line[2] = 'e'
# line = "hellodnffnjdfnjf"
# print(line[0])
# a = 6


# ЗАЧЕМ
# ЧТО ТАКОЕ СПИСОК

# lst = [1, 2, 3]
# # lst = [1,2,3,4,5]
# lst[0] = 1000
# print(lst)
# Создать строку и попытаться изменить конкретный символ
# Попытаться присвоить в переменную со строкой другую строку
# То же самое сделать со списком
# a = "World"
# a[3] = "a"
# a = "Sun"
# print(a)
# a = [1, 2]
# a[1] = 1000
# a = [1, 2, 3]
# print(a)
